Revit 2027 API
ViewSchedule.GetScheduleHeightsOnSheet Method
 Gets the heights of schedule title, column header and each schedule body row.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleHeightsOnSheet GetScheduleHeightsOnSheet()
Public Function GetScheduleHeightsOnSheet As ScheduleHeightsOnSheet
public:
ScheduleHeightsOnSheet^ GetScheduleHeightsOnSheet()
member GetScheduleHeightsOnSheet : unit -> ScheduleHeightsOnSheet
Return Value
ScheduleHeightsOnSheet
 The ScheduleHeightsOnSheet which contains heights information of a schedule on sheet.
Remarks
 The height is Revit's internal units value.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace